docs/index.org
#+TITLE: Bioscoop
#+SUBTITLE: Creative coding with video
#+OPTIONS: toc:1 num:nil
#+HTML_HEAD: <link rel="stylesheet" href="css/et-book.css" type="text/css" media="screen" />
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,300i,400,600&display=swap" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" href="css/main.css" type="text/css" media="screen" />
#+HTML_HEAD: <link rel="stylesheet" href="css/post.css" type="text/css" media="screen" />
#+HTML_HEAD:  <script type="text/javascript" src="js/navigation.js"></script>

* Motivation

Historically, video editing has progressed from destructive
techniques, ie. cutting the negative, to non-destructive ones,
ie. non-linear editing. The latter has become possible due to film
being no longer analog but digital. In both cases, however, the
creative process is manual, or mouse-based. A different approach,
often overlooked, is programmatic: the editor spells out the edits he
wants to apply, and those are being carried out by an underlying
system.  FFmpeg is such a system; capable of carrying pretty much any
editing instruction you can think of.

FFmpeg is embedded in virtually every major platform and application
that handles media, yet its use in the creative coding community to
make video art is limited. Most video creators prefer to stay away
from the notoriously complex and error-prone string-based
syntax. Indeed, its usability is hindered by the information density
of its textual interface.

Bioscoop unleashes FFmpeg from its shackles and puts programmability
in the center of the creative process.

* AST convergence

The standout feature in terms of implementation and design is that
Bioscoop does both standalone compilation and macro expansion without
code duplication. Early in the project, as soon as the grammar for the
language was defined, I realized that I didn't want to choose between
an internal or external DSL. I wanted both.

Typically, external DSLs use a parser that produces a custom abstract
syntax tree (AST), which then gets processed by a dedicated
transformation pipeline specific to that parser. Meanwhile, internal
DSLs use macros that directly generate target code without going
through an intermediate AST structure. This creates two completely
separate code generation paths - one for parsed text and another for
macro-expanded forms - leading to duplicated transformation logic,
potential behavioral inconsistencies between the two modalities, and
significant maintenance overhead as changes must be applied to both
transformation systems independently.

Traditional DSL Implementation*:
- External DSL: Parser → AST → Transformer
- Internal DSL: Macro → Direct Code Generation
- *Problem*: Transformation logic is duplicated.

In Bioscoop, a single =transform-ast= multimethod handles both external
and internal DSLs. The external parser processes text strings into a
parse tree, which is then transformed into AST nodes. The internal
macro converts Clojure forms into the exact same parse tree structure,
enabling both input modalities to share the single transformation
logic that converts the parse tree into the final AST structure. This
convergence at the parse tree level ensures behavioral consistency
while eliminating redundant transformation implementations.

*AST Convergence Approach*:
- External DSL: Parser → AST → Transformer  
- Internal DSL: Macro → AST → Transformer
- *Solution*: Single transformation logic.

*AST Convergence* occurs when both the external DSL parser and the
internal DSL macro system produce *identical abstract syntax trees*,
enabling a single transformation pipeline to handle both input
modalities.

A camera-ready /LaTeX/ paper (for conference submissions) is available
in the repository. It elaborates further on the concept of AST
convergence.

* Internals

The project is structured around several key components:

*** *DSL Parser (=src/bioscoop/dsl.clj=)*
- Uses *Instaparse* to parse a Lisp-like syntax defined in =resources/lisp-grammar.bnf=
- Grammar allows for expressions like =(scale 1920 1080)= and =(let [width 1920] (scale width 1080))=
- Supports typical Lisp constructs: functions, let bindings, symbols, keywords, strings, numbers, booleans
- Transformation of the parse tree into internal representation
  
*** *Core Data Structures*
Three main records represent FFmpeg concepts:
- *Filter*: A single filter operation (e.g., scale, overlay, crop)
- *FilterChain*: A sequence of filters connected in series (comma-separated in FFmpeg)
- *FilterGraph*: Multiple filter chains running in parallel (semicolon-separated in FFmpeg)
  
*** *Domain Model (=src/bioscoop/domain/=)*
- Uses Clojure Spec to define the structure of filters, filter chains, and filtergraphs
- Provides validation for the core data structures

*** *Rendering Engine (=src/bioscoop/render.clj=)*
- Implements the =FFmpegRenderable= protocol to convert data structures to FFmpeg syntax
- Handles input/output labels for complex filtergraphs 
- Ensures proper escaping and formatting

*** Bidirectional Translation
- /src/bioscoop/render.clj/: Converts DSL → FFmpeg filtergraph strings
- /src/bioscoop/ffmpeg.clj/: Parses existing FFmpeg filtergraph strings → DSL structures


