docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-07 Tue 02:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bioscoop</title>
<meta name="author" content="Daniel Szmulewicz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/et-book.css" type="text/css" media="screen" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro:300,300i,400,600&display=swap" rel="stylesheet">
<link rel="stylesheet" href="css/main.css" type="text/css" media="screen" />
<link rel="stylesheet" href="css/post.css" type="text/css" media="screen" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bioscoop
<br />
<span class="subtitle">Creative coding with video</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfab16a2">Motivation</a></li>
<li><a href="#orgf34c699">AST convergence</a></li>
<li><a href="#org122854d">Internals</a></li>
<li><a href="#orgdb665f9">The filtergraph</a></li>
<li><a href="#orgd394d18">The Language</a></li>
<li><a href="#org10ba488">Inspiration</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgfab16a2" class="outline-2">
<h2 id="orgfab16a2">Motivation</h2>
<div class="outline-text-2" id="text-orgfab16a2">
<p>
Historically, video editing has progressed from destructive
techniques, ie. cutting the negative, to non-destructive ones,
ie. non-linear editing. The latter has become possible due to film
being no longer analog but digital. In both cases, however, the
creative process is manual, or mouse-based. A different approach,
often overlooked, is programmatic: the editor spells out the edits he
wants to apply, and those are being carried out by an underlying
system.  FFmpeg is such a system; capable of carrying pretty much any
editing instruction you can think of.
</p>

<p>
FFmpeg is embedded in virtually every major platform and application
that handles media, yet its use in the creative coding community to
make video art is limited. Most video creators prefer to stay away
from the notoriously complex and error-prone string-based
syntax. Indeed, its usability is hindered by the information density
of its textual interface.
</p>

<p>
Bioscoop unleashes FFmpeg from its shackles and puts programmability
in the center of the creative process.
</p>
</div>
</div>
<div id="outline-container-orgf34c699" class="outline-2">
<h2 id="orgf34c699">AST convergence</h2>
<div class="outline-text-2" id="text-orgf34c699">
<p>
The standout feature in terms of implementation and design is that
Bioscoop does both standalone compilation and macro expansion without
code duplication. Early in the project, as soon as the grammar for the
language was defined, I realized that I didn't want to choose between
an internal or external DSL. I wanted both.
</p>

<p>
Typically, external DSLs use a parser that produces a custom abstract
syntax tree (AST), which then gets processed by a dedicated
transformation pipeline specific to that parser. Meanwhile, internal
DSLs use macros that directly generate target code without going
through an intermediate AST structure. This creates two completely
separate code generation paths - one for parsed text and another for
macro-expanded forms - leading to duplicated transformation logic,
potential behavioral inconsistencies between the two modalities, and
significant maintenance overhead as changes must be applied to both
transformation systems independently.
</p>

<p>
Traditional DSL Implementation*:
</p>
<ul class="org-ul">
<li>External DSL: Parser → AST → Transformer</li>
<li>Internal DSL: Macro → Direct Code Generation</li>
<li><b>Problem</b>: Transformation logic is duplicated.</li>
</ul>

<p>
In Bioscoop, a single <code>transform-ast</code> multimethod handles both external
and internal DSLs. The external parser processes text strings into a
parse tree, which is then transformed into AST nodes. The internal
macro converts Clojure forms into the exact same parse tree structure,
enabling both input modalities to share the single transformation
logic that converts the parse tree into the final AST structure. This
convergence at the parse tree level ensures behavioral consistency
while eliminating redundant transformation implementations.
</p>

<p>
<b>AST Convergence Approach</b>:
</p>
<ul class="org-ul">
<li>External DSL: Parser → AST → Transformer</li>
<li>Internal DSL: Macro → AST → Transformer</li>
<li><b>Solution</b>: Single transformation logic.</li>
</ul>

<p>
<b>AST Convergence</b> occurs when both the external DSL parser and the
internal DSL macro system produce <b>identical abstract syntax trees</b>,
enabling a single transformation pipeline to handle both input
modalities.
</p>

<p>
A camera-ready <i>LaTeX</i> <a href="file:///home/daniel/Clojure/bioscoop/paper/ast_convergence_paper.pdf">paper</a> (for conference submissions) is available
in the repository. It elaborates further on the concept of AST
convergence.
</p>
</div>
</div>
<div id="outline-container-org122854d" class="outline-2">
<h2 id="org122854d">Internals</h2>
<div class="outline-text-2" id="text-org122854d">
<p>
The project is structured around several key components:
</p>
</div>
<div id="outline-container-orgb5f2fcf" class="outline-4">
<h4 id="orgb5f2fcf"><b>DSL Parser (<code>src/bioscoop/dsl.clj</code>)</b></h4>
<div class="outline-text-4" id="text-orgb5f2fcf">
<ul class="org-ul">
<li>Uses <b>Instaparse</b> to parse a Lisp-like syntax defined in <code>resources/lisp-grammar.bnf</code></li>
<li>Grammar allows for expressions like <code>(scale 1920 1080)</code> and <code>(let [width 1920] (scale width 1080))</code></li>
<li>Supports typical Lisp constructs: functions, let bindings, symbols, keywords, strings, numbers, booleans</li>
<li>Transformation of the parse tree into internal representation</li>
</ul>
</div>
</div>
<div id="outline-container-org6534b6c" class="outline-4">
<h4 id="org6534b6c"><b>Core Data Structures</b></h4>
<div class="outline-text-4" id="text-org6534b6c">
<p>
Three main records represent FFmpeg concepts:
</p>
<ul class="org-ul">
<li><b>Filter</b>: A single filter operation (e.g., scale, overlay, crop)</li>
<li><b>FilterChain</b>: A sequence of filters connected in series (comma-separated in FFmpeg)</li>
<li><b>FilterGraph</b>: Multiple filter chains running in parallel (semicolon-separated in FFmpeg)</li>
</ul>
</div>
</div>
<div id="outline-container-org197da87" class="outline-4">
<h4 id="org197da87"><b>Domain Model (<code>src/bioscoop/domain/</code>)</b></h4>
<div class="outline-text-4" id="text-org197da87">
<ul class="org-ul">
<li>Uses Clojure Spec to define the structure of filters, filter chains, and filtergraphs</li>
<li>Provides validation for the core data structures</li>
</ul>
</div>
</div>
<div id="outline-container-orgc38b0c2" class="outline-4">
<h4 id="orgc38b0c2"><b>Rendering Engine (<code>src/bioscoop/render.clj</code>)</b></h4>
<div class="outline-text-4" id="text-orgc38b0c2">
<ul class="org-ul">
<li>Implements the <code>FFmpegRenderable</code> protocol to convert data structures to FFmpeg syntax</li>
<li>Handles input/output labels for complex filtergraphs</li>
<li>Ensures proper escaping and formatting</li>
</ul>
</div>
</div>
<div id="outline-container-orgc748ae0" class="outline-4">
<h4 id="orgc748ae0">Bidirectional Translation</h4>
<div class="outline-text-4" id="text-orgc748ae0">
<ul class="org-ul">
<li><i>src/bioscoop/render.clj</i>: Converts DSL → FFmpeg filtergraph strings</li>
<li><i>src/bioscoop/ffmpeg.clj</i>: Parses existing FFmpeg filtergraph strings → DSL structures</li>
</ul>
</div>
</div>
</div>
