docs/index.org
* The filtergraph

In FFmpeg, atomic editing operations—such as scaling, cropping,
blending, and color correction—are implemented as filters. With over
500 filters available, FFmpeg provides extensive transformation
capabilities.

When multiple filters are applied sequentially to source material,
they form a filterchain, written as comma-separated
commands. Filterchains can be labeled at their input and output
points, allowing one chain's output to serve as another's input. These
interconnected filterchains create a directed acyclic graph (DAG)
structure, which FFmpeg calls a filtergraph.  Filtergraphs are passed
to FFmpeg using the ~-filter_complex~ parameter.

That string-based syntax maps closely with the underlying ~libavfilter~
that parses it. What is happening is the following: the parser
(~libavfilter/graphparser.c~) tokenizes the string, identifying
individual filters, their parameters, and the connections between
them.

Each filter name in the string (like ~scale~, ~overlay~, ~colorkey~) maps to
a registered filter implementation in ~libavfilter~. FFmpeg looks up
these filters in its internal registry and instantiates them as
~AVFilterContext~ objects. Key-value pairs within each filter
specification are parsed and passed to the filter's initialization
function, which validates and stores them in the filter's private
context structure.

The parser creates an AVFilterGraph object and connects the
instantiated filters according to the semicolons (filterchain
boundaries) and labels in the string. Each connection becomes an
AVFilterLink that defines data flow between filter pads.

FFmpeg validates the complete graph topology, checking that
input/output pad counts match, media types are compatible (audio
vs. video), and that there are no cycles.

+ Filter names → AVFilter structs registered in libavfilter
+ Parameters (key=value) → Filter-specific configuration passed to
  AVFilter->init()
+ Filterchains (comma-separated) → Linked sequences of AVFilterContext nodes
+ Labels ([label]) → Named AVFilterLink references for graph routing
+ Semicolons → Graph branching points that create multiple parallel
  paths

This one-way translation from string to internal structures is the
core problem: there's no inverse mapping. Once parsed, the
~AVFilterGraph~ exists in memory, but there's no standardized way to
serialize it back or manipulate it programmatically before the string
parsing step. Developers must work in strings because ~libavfilter~'s
graph construction API, while programmatically accessible, is complex
and poorly documented compared to the string syntax.

The string format is essentially a convenience layer over
~libavfilter~'s C API—and it's become the /only/ practical interface,
despite its limitations.

This creates several challenges:

*No programmatic structure*: Unlike many modern tools that use JSON,
YAML, or object-based APIs, filtergraphs cannot be easily constructed,
validated, or manipulated programmatically. There's no schema to
reference, no type checking, and no ability to introspect the graph
structure before execution.

*String concatenation dependency*: Building dynamic filtergraphs
requires manual string concatenation, making the code fragile and
error-prone. A single misplaced comma, semicolon, or bracket can break
the entire pipeline, with errors only surfacing at runtime.

*Limited tooling support*: Because filtergraphs lack a formal
representation, IDEs cannot provide syntax highlighting,
auto-completion, or validation. Developers must memorize the syntax or
constantly reference documentation.

*Debugging difficulty*: When a filtergraph fails, error messages
reference the string position rather than logical components, making
it hard to identify which filter or connection caused the problem.

This string-only representation means filtergraphs are essentially
"write-only" code—difficult to read, maintain, and programmatically
generate at scale.

* The Language

The DSL accepts a Lisp-like syntax with the following core constructs:

*** Basic Syntax Elements

*Program Structure:*
- A program consists of zero or more expressions
- Multiple expressions are automatically composed into filter graphs

*Atoms:*
- *Numbers*: =42=, =-3.14=, =1920=
- *Strings*: ="hello world"=, ="in"=, ="1920x1080"=
- *Symbols*: =scale=, =my-filter=, =input-vid=
- *Keywords*: =:input=, =:output=, =:color=
- *Booleans*: =true=, =false=

*** Core Language Constructs

**** 1. *Function Calls (Lists)*
#+begin_src clojure
(scale 1920 1080)
(overlay {:input "main"} {:input "overlay"})
(drawtext "text='Hello World'" "x=100" "y=50")
#+end_src

**** 2. *Variable Binding (let)*
#+begin_src clojure
(let [width 1920
      height 1080]
  (scale width height))
#+end_src

**** 3. *Filter Chains*
#+begin_src clojure
(chain
  (scale 1920 1080)
  (crop "iw/2" "ih" "0" "0")
  (hflip))
#+end_src

**** 4. *Filter Graphs (Parallel Processing)*
#+begin_src clojure
(graph
  (chain (scale 1920 1080) (crop "220"))
  (chain (hflip) (vflip)))
#+end_src

