docs/index.html
<div id="outline-container-orgdb665f9" class="outline-2">
<h2 id="orgdb665f9">The filtergraph</h2>
<div class="outline-text-2" id="text-orgdb665f9">
<p>
In FFmpeg, atomic editing operations—such as scaling, cropping,
blending, and color correction—are implemented as filters. With over
500 filters available, FFmpeg provides extensive transformation
capabilities.
</p>

<p>
When multiple filters are applied sequentially to source material,
they form a filterchain, written as comma-separated
commands. Filterchains can be labeled at their input and output
points, allowing one chain's output to serve as another's input. These
interconnected filterchains create a directed acyclic graph (DAG)
structure, which FFmpeg calls a filtergraph.  Filtergraphs are passed
to FFmpeg using the <code>-filter_complex</code> parameter.
</p>

<p>
That string-based syntax maps closely with the underlying <code>libavfilter</code>
that parses it. What is happening is the following: the parser
(<code>libavfilter/graphparser.c</code>) tokenizes the string, identifying
individual filters, their parameters, and the connections between
them.
</p>

<p>
Each filter name in the string (like <code>scale</code>, <code>overlay</code>, <code>colorkey</code>) maps to
a registered filter implementation in <code>libavfilter</code>. FFmpeg looks up
these filters in its internal registry and instantiates them as
<code>AVFilterContext</code> objects. Key-value pairs within each filter
specification are parsed and passed to the filter's initialization
function, which validates and stores them in the filter's private
context structure.
</p>

<p>
The parser creates an AVFilterGraph object and connects the
instantiated filters according to the semicolons (filterchain
boundaries) and labels in the string. Each connection becomes an
AVFilterLink that defines data flow between filter pads.
</p>

<p>
FFmpeg validates the complete graph topology, checking that
input/output pad counts match, media types are compatible (audio
vs. video), and that there are no cycles.
</p>

<ul class="org-ul">
<li>Filter names → AVFilter structs registered in libavfilter</li>
<li>Parameters (key=value) → Filter-specific configuration passed to
AVFilter-&gt;init()</li>
<li>Filterchains (comma-separated) → Linked sequences of AVFilterContext nodes</li>
<li>Labels ([label]) → Named AVFilterLink references for graph routing</li>
<li>Semicolons → Graph branching points that create multiple parallel
paths</li>
</ul>

<p>
This one-way translation from string to internal structures is the
core problem: there's no inverse mapping. Once parsed, the
<code>AVFilterGraph</code> exists in memory, but there's no standardized way to
serialize it back or manipulate it programmatically before the string
parsing step. Developers must work in strings because <code>libavfilter</code>'s
graph construction API, while programmatically accessible, is complex
and poorly documented compared to the string syntax.
</p>

<p>
The string format is essentially a convenience layer over
<code>libavfilter</code>'s C API—and it's become the <i>only</i> practical interface,
despite its limitations.
</p>

<p>
This creates several challenges:
</p>

<p>
<b>No programmatic structure</b>: Unlike many modern tools that use JSON,
YAML, or object-based APIs, filtergraphs cannot be easily constructed,
validated, or manipulated programmatically. There's no schema to
reference, no type checking, and no ability to introspect the graph
structure before execution.
</p>

<p>
<b>String concatenation dependency</b>: Building dynamic filtergraphs
requires manual string concatenation, making the code fragile and
error-prone. A single misplaced comma, semicolon, or bracket can break
the entire pipeline, with errors only surfacing at runtime.
</p>

<p>
<b>Limited tooling support</b>: Because filtergraphs lack a formal
representation, IDEs cannot provide syntax highlighting,
auto-completion, or validation. Developers must memorize the syntax or
constantly reference documentation.
</p>

<p>
<b>Debugging difficulty</b>: When a filtergraph fails, error messages
reference the string position rather than logical components, making
it hard to identify which filter or connection caused the problem.
</p>

<p>
This string-only representation means filtergraphs are essentially
"write-only" code—difficult to read, maintain, and programmatically
generate at scale.
</p>
</div>
</div>
<div id="outline-container-orgd394d18" class="outline-2">
<h2 id="orgd394d18">The Language</h2>
<div class="outline-text-2" id="text-orgd394d18">
<p>
The DSL accepts a Lisp-like syntax with the following core constructs:
</p>
</div>
<div id="outline-container-orgcda67ad" class="outline-4">
<h4 id="orgcda67ad">Basic Syntax Elements</h4>
<div class="outline-text-4" id="text-orgcda67ad">
<p>
<b>Program Structure:</b>
</p>
<ul class="org-ul">
<li>A program consists of zero or more expressions</li>
<li>Multiple expressions are automatically composed into filter graphs</li>
</ul>

<p>
<b>Atoms:</b>
</p>
<ul class="org-ul">
<li><b>Numbers</b>: <code>42</code>, <code>-3.14</code>, <code>1920</code></li>
<li><b>Strings</b>: <code>"hello world"</code>, <code>"in"</code>, <code>"1920x1080"</code></li>
<li><b>Symbols</b>: <code>scale</code>, <code>my-filter</code>, <code>input-vid</code></li>
<li><b>Keywords</b>: <code>:input</code>, <code>:output</code>, <code>:color</code></li>
<li><b>Booleans</b>: <code>true</code>, <code>false</code></li>
</ul>
</div>
</div>
<div id="outline-container-org60ee383" class="outline-4">
<h4 id="org60ee383">Core Language Constructs</h4>
<div class="outline-text-4" id="text-org60ee383">
</div>
<ul class="org-ul">
<li><a id="org0050f55"></a>1. <b>Function Calls (Lists)</b><br />
<div class="outline-text-5" id="text-org0050f55">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>scale 1920 1080<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>overlay <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"main"</span><span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"overlay"</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>drawtext <span style="color: #8b2252;">"text='Hello World'"</span> <span style="color: #8b2252;">"x=100"</span> <span style="color: #8b2252;">"y=50"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgea14400"></a>2. <b>Variable Binding (let)</b><br />
<div class="outline-text-5" id="text-orgea14400">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #7388d6;">[</span>width 1920
      height 1080<span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span>scale width height<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org940b1bf"></a>3. <b>Filter Chains</b><br />
<div class="outline-text-5" id="text-org940b1bf">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>chain
  <span style="color: #7388d6;">(</span>scale 1920 1080<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>crop <span style="color: #8b2252;">"iw/2"</span> <span style="color: #8b2252;">"ih"</span> <span style="color: #8b2252;">"0"</span> <span style="color: #8b2252;">"0"</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>hflip<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgcb38091"></a>4. <b>Filter Graphs (Parallel Processing)</b><br />
<div class="outline-text-5" id="text-orgcb38091">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>graph
  <span style="color: #7388d6;">(</span>chain <span style="color: #909183;">(</span>scale 1920 1080<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>crop <span style="color: #8b2252;">"220"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>chain <span style="color: #909183;">(</span>hflip<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>vflip<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
