docs/index.org
**** 5. *Graph Definitions (Reusable Components)*
#+begin_src clojure
(defgraph my-scale (scale 1920 1080))
(defgraph mirror-pipeline 
  (chain 
    (crop "iw/2" "ih" "0" "0") 
    (split {:output "left"} {:output "tmp"})
    (hflip {:input "tmp"} {:output "right"})
    (hstack {:input "left"} {:input "right"})))
#+end_src

**** 6. *Label Management*

*Explicit Labels:*
#+begin_src clojure
(input-labels "in" "video0")
(output-labels "out" "processed")
#+end_src

*Inline Labels (Map Syntax):*
#+begin_src clojure
(scale 1920 1080 {:input "in"} {:output "scaled"})
#+end_src

**** 7. *Padded Graphs (Complex Labeling)*
#+begin_src clojure
[[in][offset] (chain (scale 1920 1080) (crop "220")) [out]]
[[v:0][v:1] my-complex-filter [processed]]
#+end_src

**** 8. *Composition*
#+begin_src clojure
(compose graph1 graph2 graph3)
#+end_src

*** Built-in Functions

The DSL provides access to numerous FFmpeg filters including:

- *Scaling & Cropping*: =scale=, =crop=, =pad=
- *Color & Effects*: =color=, =hue=, =negate=, =curves=, =threshold=
- *Layout & Composition*: =hstack=, =vstack=, =xstack=, =overlay=, =blend=
- *Transforms*: =hflip=, =vflip=, =zoompan=
- *Text & Drawing*: =drawtext=, =drawgrid=
- *Sources*: =testsrc=, =rgbtestsrc=, =smptebars=
- *Time-based*: =fade=, =loop=, =trim=, =setpts=
- *Advanced*: =split=, =concat=, =lut=, =lagfun=, =cellauto=

*** Parameter Passing

*Positional Parameters:*
#+begin_src clojure
(scale 1920 1080)
(crop "iw/2" "ih" "0" "0")
#+end_src

*Named Parameters (Maps):*
#+begin_src clojure
(color {:color "blue" :size "1920x1080" :rate 24 :duration "10"})
(drawtext {:text "Hello World" :x 100 :y 50 :fontsize 24})
#+end_src

*** Advanced Features

**** Mathematical Expressions
#+begin_src clojure
(let [width (mod 10 6)
      size (max 1920 1080)
      next (inc 1919)]
  (scale width size))
#+end_src

**** Complex Pipeline Example
#+begin_src clojure
(let [out-left-tmp (output-labels "left" "tmp")
      in-tmp (input-labels "tmp") 
      out-right (output-labels "right")
      in-left-right (input-labels "left" "right")]
  (graph
    (chain
      (crop "iw/2" "ih" "0" "0")
      (split out-left-tmp))
    (hflip in-tmp out-right)
    (hstack in-left-right)))
#+end_src

This compiles to the FFmpeg filter graph:
#+begin_src 
crop=out_w=iw/2:w=ih:out_h=0:h=0,split[left][tmp];[tmp]hflip[right];[left][right]hstack
#+end_src

*** Language Design Principles

1. *Composability*: Every construct can be composed with others
2. *Immutability*: Variables are bound once and cannot be reassigned
3. *Explicit Labeling*: Stream labels are first-class citizens
4. *Structural Equivalence*: The DSL produces the same internal structures as parsing FFmpeg commands directly
5. *Error Handling*: Comprehensive error reporting for invalid parameters and syntax

*** Grammar Rules (BNF Summary)

The language follows these production rules:

#+begin_src 
program = expression*
expression = atom | list | let-binding | map | compose | graph-definition | padded-graph
let-binding = '(' 'let' binding-vector expression+ ')'
graph-definition = '(' 'defgraph' symbol expression* ')'
padded-graph = '[' label+ expression* label+ ']'
compose = '(' 'compose' expression+ ')'
list = '(' expression* ')'
map = '{' mapentry* '}'
atom = number | boolean | symbol | string | keyword
#+end_src


