docs/index.html
<li><a id="org8c76164"></a>5. <b>Graph Definitions (Reusable Components)</b><br />
<div class="outline-text-5" id="text-org8c76164">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>defgraph my-scale <span style="color: #7388d6;">(</span>scale 1920 1080<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>defgraph mirror-pipeline 
  <span style="color: #7388d6;">(</span>chain 
    <span style="color: #909183;">(</span>crop <span style="color: #8b2252;">"iw/2"</span> <span style="color: #8b2252;">"ih"</span> <span style="color: #8b2252;">"0"</span> <span style="color: #8b2252;">"0"</span><span style="color: #909183;">)</span> 
    <span style="color: #909183;">(</span>split <span style="color: #709870;">{</span><span style="color: #008b8b;">:output</span> <span style="color: #8b2252;">"left"</span><span style="color: #709870;">}</span> <span style="color: #709870;">{</span><span style="color: #008b8b;">:output</span> <span style="color: #8b2252;">"tmp"</span><span style="color: #709870;">}</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>hflip <span style="color: #709870;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"tmp"</span><span style="color: #709870;">}</span> <span style="color: #709870;">{</span><span style="color: #008b8b;">:output</span> <span style="color: #8b2252;">"right"</span><span style="color: #709870;">}</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>hstack <span style="color: #709870;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"left"</span><span style="color: #709870;">}</span> <span style="color: #709870;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"right"</span><span style="color: #709870;">}</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgd0bfcc5"></a>6. <b>Label Management</b><br />
<div class="outline-text-5" id="text-orgd0bfcc5">
<p>
<b>Explicit Labels:</b>
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>input-labels <span style="color: #8b2252;">"in"</span> <span style="color: #8b2252;">"video0"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>output-labels <span style="color: #8b2252;">"out"</span> <span style="color: #8b2252;">"processed"</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
<b>Inline Labels (Map Syntax):</b>
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>scale 1920 1080 <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:input</span> <span style="color: #8b2252;">"in"</span><span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:output</span> <span style="color: #8b2252;">"scaled"</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org0d34e6f"></a>7. <b>Padded Graphs (Complex Labeling)</b><br />
<div class="outline-text-5" id="text-org0d34e6f">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">[</span><span style="color: #7388d6;">[</span>in<span style="color: #7388d6;">][</span>offset<span style="color: #7388d6;">]</span> <span style="color: #7388d6;">(</span>chain <span style="color: #909183;">(</span>scale 1920 1080<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>crop <span style="color: #8b2252;">"220"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">[</span>out<span style="color: #7388d6;">]</span><span style="color: #707183;">]</span>
<span style="color: #707183;">[</span><span style="color: #7388d6;">[</span>v:0<span style="color: #7388d6;">][</span>v:1<span style="color: #7388d6;">]</span> my-complex-filter <span style="color: #7388d6;">[</span>processed<span style="color: #7388d6;">]</span><span style="color: #707183;">]</span>
</pre>
</div>
</div>
</li>
<li><a id="org8e9fffe"></a>8. <b>Composition</b><br />
<div class="outline-text-5" id="text-org8e9fffe">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>compose graph1 graph2 graph3<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd001cc2" class="outline-4">
<h4 id="orgd001cc2">Built-in Functions</h4>
<div class="outline-text-4" id="text-orgd001cc2">
<p>
The DSL provides access to numerous FFmpeg filters including:
</p>

<ul class="org-ul">
<li><b>Scaling &amp; Cropping</b>: <code>scale</code>, <code>crop</code>, <code>pad</code></li>
<li><b>Color &amp; Effects</b>: <code>color</code>, <code>hue</code>, <code>negate</code>, <code>curves</code>, <code>threshold</code></li>
<li><b>Layout &amp; Composition</b>: <code>hstack</code>, <code>vstack</code>, <code>xstack</code>, <code>overlay</code>, <code>blend</code></li>
<li><b>Transforms</b>: <code>hflip</code>, <code>vflip</code>, <code>zoompan</code></li>
<li><b>Text &amp; Drawing</b>: <code>drawtext</code>, <code>drawgrid</code></li>
<li><b>Sources</b>: <code>testsrc</code>, <code>rgbtestsrc</code>, <code>smptebars</code></li>
<li><b>Time-based</b>: <code>fade</code>, <code>loop</code>, <code>trim</code>, <code>setpts</code></li>
<li><b>Advanced</b>: <code>split</code>, <code>concat</code>, <code>lut</code>, <code>lagfun</code>, <code>cellauto</code></li>
</ul>
</div>
</div>
<div id="outline-container-org8394c03" class="outline-4">
<h4 id="org8394c03">Parameter Passing</h4>
<div class="outline-text-4" id="text-org8394c03">
<p>
<b>Positional Parameters:</b>
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>scale 1920 1080<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>crop <span style="color: #8b2252;">"iw/2"</span> <span style="color: #8b2252;">"ih"</span> <span style="color: #8b2252;">"0"</span> <span style="color: #8b2252;">"0"</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
<b>Named Parameters (Maps):</b>
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>color <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:color</span> <span style="color: #8b2252;">"blue"</span> <span style="color: #008b8b;">:size</span> <span style="color: #8b2252;">"1920x1080"</span> <span style="color: #008b8b;">:rate</span> 24 <span style="color: #008b8b;">:duration</span> <span style="color: #8b2252;">"10"</span><span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>drawtext <span style="color: #7388d6;">{</span><span style="color: #008b8b;">:text</span> <span style="color: #8b2252;">"Hello World"</span> <span style="color: #008b8b;">:x</span> 100 <span style="color: #008b8b;">:y</span> 50 <span style="color: #008b8b;">:fontsize</span> 24<span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2629339" class="outline-4">
<h4 id="org2629339">Advanced Features</h4>
<div class="outline-text-4" id="text-org2629339">
</div>
<ul class="org-ul">
<li><a id="org3e96d25"></a>Mathematical Expressions<br />
<div class="outline-text-5" id="text-org3e96d25">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #7388d6;">[</span>width <span style="color: #909183;">(</span>mod 10 6<span style="color: #909183;">)</span>
      size <span style="color: #909183;">(</span>max 1920 1080<span style="color: #909183;">)</span>
      next <span style="color: #909183;">(</span>inc 1919<span style="color: #909183;">)</span><span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span>scale width size<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org3730d40"></a>Complex Pipeline Example<br />
<div class="outline-text-5" id="text-org3730d40">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #a020f0;">let</span> <span style="color: #7388d6;">[</span>out-left-tmp <span style="color: #909183;">(</span>output-labels <span style="color: #8b2252;">"left"</span> <span style="color: #8b2252;">"tmp"</span><span style="color: #909183;">)</span>
      in-tmp <span style="color: #909183;">(</span>input-labels <span style="color: #8b2252;">"tmp"</span><span style="color: #909183;">)</span> 
      out-right <span style="color: #909183;">(</span>output-labels <span style="color: #8b2252;">"right"</span><span style="color: #909183;">)</span>
      in-left-right <span style="color: #909183;">(</span>input-labels <span style="color: #8b2252;">"left"</span> <span style="color: #8b2252;">"right"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">]</span>
  <span style="color: #7388d6;">(</span>graph
    <span style="color: #909183;">(</span>chain
      <span style="color: #709870;">(</span>crop <span style="color: #8b2252;">"iw/2"</span> <span style="color: #8b2252;">"ih"</span> <span style="color: #8b2252;">"0"</span> <span style="color: #8b2252;">"0"</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>split out-left-tmp<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>hflip in-tmp out-right<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>hstack in-left-right<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This compiles to the FFmpeg filter graph:
</p>
<div class="org-src-container">
<pre class="src src-nil">crop=out_w=iw/2:w=ih:out_h=0:h=0,split[left][tmp];[tmp]hflip[right];[left][right]hstack
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org10da70f" class="outline-4">
<h4 id="org10da70f">Language Design Principles</h4>
<div class="outline-text-4" id="text-org10da70f">
<ol class="org-ol">
<li><b>Composability</b>: Every construct can be composed with others</li>
<li><b>Immutability</b>: Variables are bound once and cannot be reassigned</li>
<li><b>Explicit Labeling</b>: Stream labels are first-class citizens</li>
<li><b>Structural Equivalence</b>: The DSL produces the same internal structures as parsing FFmpeg commands directly</li>
<li><b>Error Handling</b>: Comprehensive error reporting for invalid parameters and syntax</li>
</ol>
</div>
</div>
<div id="outline-container-orge378def" class="outline-4">
<h4 id="orge378def">Grammar Rules (BNF Summary)</h4>
<div class="outline-text-4" id="text-orge378def">
<p>
The language follows these production rules:
</p>

<div class="org-src-container">
<pre class="src src-nil">program = expression*
expression = atom | list | let-binding | map | compose | graph-definition | padded-graph
let-binding = '(' 'let' binding-vector expression+ ')'
graph-definition = '(' 'defgraph' symbol expression* ')'
padded-graph = '[' label+ expression* label+ ']'
compose = '(' 'compose' expression+ ')'
list = '(' expression* ')'
map = '{' mapentry* '}'
atom = number | boolean | symbol | string | keyword
</pre>
</div>
</div>
</div>
</div>
