docs/index.html
<div id="outline-container-org10ba488" class="outline-2">
<h2 id="org10ba488">Inspiration</h2>
<div class="outline-text-2" id="text-org10ba488">
<blockquote>
<p>
The acts of the mind, wherein it exerts its power over simple ideas, are chiefly these three:
</p>

<ol class="org-ol">
<li>Combining several simple ideas into one compound one, and thus all
complex ideas are made.</li>

<li>The second is bringing two ideas, whether simple or complex,
together, and setting them by one another so as to take a view of
them at once, without uniting them into one, by which it gets all
its ideas of relations.</li>

<li>The third is separating them from all other ideas that accompany
them in their real existence: this is called abstraction, and thus
all its general ideas are made.</li>
</ol>

<p>
—John Locke, An Essay Concerning Human Understanding (1690)
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Szmulewicz</p>
<p class="date">Created: 2025-10-07 Tue 02:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
